# 타입 : 숫자, 문자열 

print('python')
print("python")

# 두개 의 글자인 python은 똑같이 출력한다.

# " ",' ' 문자열이라는 것을 의미해준다. 문자열의 시작 및 끝이라는 의미

# "python"
print('"python"')

# 모든 언어에서는 ''안에 있는 ""은 글자라고 인식해버린다. 반대도 똑같다. 

# 'python'을 출력해봐라
print("'print'")

# 큰 따음표와 작은 따음표는 완전히 같은 것이다.


# """""" 줄을 바꿀 수 있는 문자열이다. 
print("""줄 바꿀 수 
      
    있는 문자열 
      """)

"""
여기를 주석이라고 하자(여러 줄을 주석할 경우 )
아무것도 아니다. 출력은 되지 않는다. 
"""

"""
예제는 파이썬 300제, 순서는 나도코딩 파이썬을 참고하세요!
짐코딩이라는 사람도 괜찮아요, 코딩 알려주는 누나등등 
"""

print("1. Hello World")
print("2. Mary's coffee")
print('3. "도둑이야"')


