# 파이썬은 타입을 바꿀 수 있고, 파이썬이 알아서 바꾸는 경우도 있다.
# 자바 - 자동으로 바뀌지 않는다. 바꾸라고 해야 바뀐다. (큰거 만들때 사용)
# 자바스트립 - 자동으로 바뀐다. (작은거를 만들때)

# int, float, bool, str, (list, set, diction)
# 타입을 바꾸는 함수는 타입의 이름과 같다.

int('3')
# 이렇게 사용하면 문자를 숫자로 바꿀 수 있다.

# '3'을 정수로 바꾼 다음 타입을 확인해보자
print(type(int('3')))
print()

# 6이 나오게 수정
print(3+int('3'))

# 함수는 무조건 ()을 같이 사용해야한다. 

print(str(3)+'3')

# 3 + '3.14'를 출력, 실수는 근사값이다. 그렇기때문에 실수랑 계산을 하면 오차값이 나올 수 있다.
print(3+float('3.14'))

print('3'+'3')

# '55'

print('5' + str(5))

print('당신은 성인입니까?' + str(True))

# 생각보다 까다롭다. 그렇기때문에 내가 직접 타입을 바꿔줘라.

