# 기본 type(원래부터 있는 타입) : 처리할 수 있는 데이터의 종류 
#        문자열, 숫자, 참거짓
# 자바스크립트 : 문자열, 숫자, 참거짓
#               string, number, bool
# 파이썬 : str, int, float, bool - 파이썬도 날짜는 있다. 근데 확장을 깔아야한다. 
#           모듈로 확장
#           vscode에서는 확장을 들어가면 된다. 
#           import -> 확장한것을 읽어오는 것
import datetime

# 오라클 : char, number, date(날짜) - 데이터를 저장하기 때문에 날짜가 중요하다. 
# 오라클에는 bool이 없다. 
 
# 파이썬의 기본 타입 : str, int, float, bool

# literal -> 데이터(값) 그 자체를 뜻한다. 그냥 3이라고만 쓴다. 
# html로 보내면 무조건 보낼 수 있다. 
# pdf로 보내기도 한다. 논문같은거 보낼때

# 함수 : 기능에 이름이 붙인다. 왜? 재사용하기 위해서 
# 함수가 동작하려면 내가 원하는 값을 넘겨줘야한다. -> 인자(값을 줘야한다.)

print(3)
print(3,4,5, sep='')
# sep -> 인자중에 이름이 정해진 인자들이 있다.
# 사전에 이름이 정해져있는 값들이 정해져있다. sep처럼
# 예) print()라고 써야한다. -> 출력하고 줄을 바꿔준다. 
print("안녕"+"친구")


# ,는 공백이 생긴다, +은 그냥 붙혀준다. 
# 인자중에 이름이 정해진 인자 

print('신씨가 소리질렀다. "도둑이야"')
print("naver","kakao","sk","samsung", sep=";")
print("naver","kakao","sk","samsung", sep="/")

# 인터넷에 돌아 다니것은 모두 글자로 이루어져 있다. 
# sep은 값과 값 사이를 구분하는 것이다. sep=""로 구분한다.
# end는 끝에만 나온다. 
