# 기계어  - 컴퓨터(CPU)가 이해할 수 있는 이진수 언어 - 사람이 사용하기 힘들다.

# 고급언어 - 사람이 이해하고 작성하기 위한 프로그래밍 언어

# 번역프로그램이 필요하다. (컴퓨터는 고급언어를 이해할 수 없기 때문이다.)
# python 설치 - 파이썬 source를 번역하고 실행해주는 프로그램

# 통합개발환경(IDE) - 소스편집 + 실행 + 각종 부가기능
# vscode(완전 ide가 아니라 비슷하게 사용할 수 있다.)만 설치한다고 실행안됨, 파이썬도 같이 설치해야한다. 

# 연습용으로는 vscode를 많이 사용한다. 하지만 전문적으로 한다면 vscode를 그렇게 많이 사용하지 않는다.
# 에러표시가 명확하지 않기 때문이다.

# type - 어떤 언어들이 사용하는 정의
# 하나의 값 : int, float, str, bool (자바스크립트는 number로 처리한다. 왜?)
# 값들 : list - [2,3,4], dictionary - {"irum" : "홍길동", "nai" : 20}
# list 값이 서로 상관없음, dictionary 값이 서로 연관되어 있다. 

# 정의 : 변수나 함수를 만드는 것

art = {"irum" : "홍길동", "nai" : 20}

"""
이해하지 못한거  
1. print(nai)를 출력할 수 없다. why? 이름을 붙여있지 않아서(변수를 붙이지 않음.)
dictionary도 변수를 붙여야 사용할 수 있다. dictionary안에 있는 nai를 바로 출력 안된다.
"""
