"""
# 연산
# 산술연산 
# +, -, *, /
몫 : //(몫은 정수로 나온다), 나머지 : %
"""

print(18/5)

print(18//5)
print(17%5)

x= 15.82
x=x//1
print(x)


a,b = 37, 5
#  %연산 금지, 나머지 4를 출력하시오. 

# 19 - (5*(19//5)) = 4
h = a - ((a//b) * b ) 
print(h)

# y의 1의 자리에서 버림 
# 1의 자리니까 10으로 나누면 1의 자리만 나온다. 
y = 453 
result = y - (y%10)
print(result)

# 1의 자리를 10의 자리를 100의 자리를 원하는 10의 제곱근 자리를 버리고 싶으면, 몫을 구해서 다시 곱해서 전체에서 빼면된다.
z = 34324
result = z - (z- ((z//1000)* 1000) )
print(result)



# 숫자를 입력하면 그 숫자보다 작은 최대의 짝수 
# 7 -> 6



# 숫자를 입력하면 그 숫자이상의 가장 큰 7의 배수 출력 
# 15-> 21, 21 -> 21, 

random = int(input("숫자 입력"))
a = ((random//7)*(7*(random%7)))
print(a)

